In [2]:
import pandas as pd
import numpy as np
from datetime import datetime
from datetime import timedelta
import time

In [3]:
df = pd.read_csv('./data/marathon_results_2016.csv',usecols=['Bib','40K',
                'Half','Pace','Age','M/F','Country','State','City'],
                index_col=['Bib'])

df['40K'] = df['40K'].replace('-',0)
df['Half'] = df['Half'].replace('-',0)

df['40K'] = df['40K'].apply(pd.to_timedelta)
df['Half'] = df['Half'].apply(pd.to_timedelta)

df['TotalSeconds'] = df['40K'].apply(lambda x: timedelta.total_seconds(x))
df['HalfSeconds'] = df['Half'].apply(lambda x: timedelta.total_seconds(x))

df['TotalSeconds'] = df['TotalSeconds'].replace(0,np.nan)
df['HalfSeconds'] = df['HalfSeconds'].replace(0,np.nan)

df.head()

,Age,M/F,City,State,Country,Half,40K,Pace,TotalSeconds,HalfSeconds
Bib,,,,,,,,,,
5,21,M,Addis Ababa,NaN,ETH,0 days 01:06:45,0 days 02:05:59,0:05:04,7559.0,4005.0
1,26,M,Ambo,NaN,ETH,0 days 01:06:46,0 days 02:05:59,0:05:06,7559.0,4006.0
6,31,M,Addis Ababa,NaN,ETH,0 days 01:06:44,0 days 02:06:47,0:05:07,7607.0,4004.0
11,33,M,Kitale,NaN,KEN,0 days 01:06:46,0 days 02:06:47,0:05:07,7607.0,4006.0
14,23,M,Eldoret,NaN,KEN,0 days 01:06:46,0 days 02:08:11,0:05:11,7691.0,4006.0

In [4]:
df['City'].info()

<class 'pandas.core.series.Series'>
Index: 26630 entries, 5 to 28487
Series name: City
Non-Null Count  Dtype
--------------  -----
26629 non-null  object
dtypes: object(1)
memory usage: 416.1+ KB

In [5]:
df['City'].describe()

count      26629
unique      5832
top       Boston
freq         722
Name: City, dtype: object

In [6]:
df['City'].value_counts()

Boston                 722
New York               451
Chicago                261
Toronto                223
San Francisco          197
                      ...
Portstmouth              1
Sandy Springs            1
Stupava                  1
Santa Catarina N.l.      1
Reedsburg                1
Name: City, Length: 5832, dtype: int64

In [7]:
df['City'].unique()

array(['Addis Ababa', 'Ambo', 'Kitale', ..., 'Justin', 'Rossmoor',
       'Reedsburg'], dtype=object)

In [8]:
df['City'].nunique()

5832

In [9]:
cities = df['City'].unique()

In [10]:
groups={}

In [11]:
for x in cities:
    SubDfCities = df.where(df['City'] == x).dropna()
    groups[x] = SubDfCities

In [ ]:
for city in cities:
    tmp_df = df.loc[df['City']==city]
    groups[city] = tmp_df